Emacs.org
#+TITLE: Daut's Configuration
#+PROPERTY: header-args:emacs-lisp :mkdirp yes :tangle .emacs.d/init.el
#+STARTUP: overview

* Runtime Performance
#+begin_src emacs-lisp
;; Improve lsp perf https://emacs-lsp.github.io/lsp-mode/page/performance/#increase-the-amount-of-data-which-emacs-reads-from-the-process
(setq read-process-output-max (* 1024 1024)) ;; 1mb

(defun daut/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                    (time-subtract after-init-time before-init-time)))
           gcs-done))
(add-hook 'emacs-startup-hook #'daut/display-startup-time)

;; Should make working with long lines faster https://emacs.stackexchange.com/questions/598/how-do-i-prevent-extremely-long-lines-making-emacs-slow
(setq bidi-inhibit-bpa t)
(setq bidi-paragraph-direction 'left-to-right)
(global-so-long-mode 1)

;; Garbage Collector Magic Hack
(use-package gcmh
  :diminish
  :hook (emacs-startup . gcmh-mode)
  :init
  (setq gcmh-idle-delay 'auto
        gcmh-auto-idle-delay-factor 10
        gcmh-high-cons-threshold #x1000000)) ; 16MB

#+end_src
* Package System Setup
#+begin_src emacs-lisp

;; Initialize package sources
(require 'package)
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(require 'use-package)
(setq use-package-always-ensure t)
(setq use-package-verbose t) ;; write useful information about package loading
(setq use-package-compute-statistics t) ;; report how much time a package needs to load

(unless (package-installed-p 'vc-use-package)
  (package-vc-install "https://github.com/slotThe/vc-use-package"))
(require 'vc-use-package)

#+end_src

** Auto update packages
#+begin_src emacs-lisp

(use-package auto-package-update
  :custom
  ;; interval in days
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results nil)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "09:00"))

#+end_src
* Restart Emacs Command
#+begin_src emacs-lisp
(use-package restart-emacs)
#+end_src
* Keep init.el Clean
#+begin_src emacs-lisp

;; Save all of the custom data in custom.el
(setq custom-file (concat user-emacs-directory "custom.el"))
(when (file-exists-p custom-file)
  (load custom-file))
(use-package no-littering
  :config
  (setq create-lockfiles nil))

 #+end_src
* Environment Vars
Environment variables sometimes aren't right, this fixes it.
#+begin_src emacs-lisp
(use-package exec-path-from-shell
  :if (memq window-system '(mac ns x))
  :demand
  :config
  (setq exec-path-from-shell-check-startup-files nil)
  (setq exec-path-from-shell-variables '("PATH" "MANPATH" "GOPATH" "GOPRIVATE" "PYTHONPATH" "NODE_PATH" "RUSTUP_HOME" "CARGO_HOME"))
  (setq exec-path-from-shell-arguments '("-l"))
  (exec-path-from-shell-initialize))
#+end_src
* Info Docs
#+begin_src emacs-lisp
(add-to-list 'Info-directory-list
             (expand-file-name "./books" user-emacs-directory))
#+end_src
* Font Configuration

#+begin_src emacs-lisp
(use-package emacs
  :custom
  (enable-recursive-minibuffers t)
  (pixel-scroll-precision-mode t)
  :config
  (defvar daut/default-font-size 150)
  (set-face-attribute 'default nil :font "JetBrains Mono" :height daut/default-font-size)
  ;; necessary as a fallback for org-modern mode
  (set-fontset-font "fontset-default" '(#x2BC6 . #x2BC6)
                    (font-spec :family "Iosevka Aile") nil 'append))

(use-package ligature
  :config
  (ligature-set-ligatures 'prog-mode '("--" "---" "==" "===" "!=" "!==" "=!="
                              "=:=" "=/=" "<=" ">=" "&&" "&&&" "&=" "++" "+++" "***" ";;" "!!"
                              "??" "???" "?:" "?." "?=" "<:" ":<" ":>" ">:" "<:<" "<>" "<<<" ">>>"
                              "<<" ">>" "||" "-|" "_|_" "|-" "||-" "|=" "||=" "##" "###" "####"
                              "#{" "#[" "]#" "#(" "#?" "#_" "#_(" "#:" "#!" "#=" "^=" "<$>" "<$"
                              "$>" "<+>" "<+" "+>" "<*>" "<*" "*>" "</" "</>" "/>" "<!--" "<#--"
                              "-->" "->" "->>" "<<-" "<-" "<=<" "=<<" "<<=" "<==" "<=>" "<==>"
                              "==>" "=>" "=>>" ">=>" ">>=" ">>-" ">-" "-<" "-<<" ">->" "<-<" "<-|"
                              "<=|" "|=>" "|->" "<->" "<~~" "<~" "<~>" "~~" "~~>" "~>" "~-" "-~"
                              "~@" "[||]" "|]" "[|" "|}" "{|" "[<" ">]" "|>" "<|" "||>" "<||"
                              "|||>" "<|||" "<|>" "..." ".." ".=" "..<" ".?" "::" ":::" ":=" "::="
                              ":?" ":?>" "//" "///" "/*" "*/" "/=" "//=" "/==" "@_" "__" "???"
                              "<:<" ";;;"))
  (global-ligature-mode t))
#+end_src
* Completion Configuration
** Which Key

~which-key~ is a useful UI panel that appears when you start pressing any key binding in Emacs to offer you all possible completions for the prefix.

#+begin_src emacs-lisp

(use-package which-key
  :defer 0
  :diminish which-key-mode
  :config
  (which-key-mode)
  (setq which-key-idle-delay 0.3))

#+end_src
** Vertico + Consult + Marginalia + Embark + Orderless
#+begin_src emacs-lisp
(defun daut/minibuffer-backward-kill (arg)
  (interactive "p")
  (if (and minibuffer-completing-file-name
           (eq (char-before) ?/))
      (zap-up-to-char (- arg) ?/)
    (delete-backward-char arg)))

(use-package vertico
  :init (vertico-mode)
  :bind ("<backspace>" . daut/minibuffer-backward-kill))

(use-package vertico-posframe
  :init (vertico-posframe-mode)
  :config
  (setq vertico-multiform-commands
        '((consult-line (:not posframe))
          (consult-ripgrep (:not posframe))
          (t posframe)))
  (vertico-multiform-mode t))

(defun daut/selected-region-or-symbol-at-point ()
  "Return the selected region, otherwise return the symbol at point."
  (if (region-active-p)
      (buffer-substring-no-properties (region-beginning) (region-end))
    (thing-at-point 'symbol t)))
;; TODO: https://www.reddit.com/r/emacs/comments/16g08me/killbuffer_from_the_minibuffer_after_mx/
(use-package consult
  :bind
  ("C-s"   . consult-line)
  ("C-x b" . consult-buffer)
  ("s-F"   . consult-ripgrep)
  ;; goto
  ("M-g i" . consult-imenu)
  ;; search
  ("M-s d" . consult-find)
  :config
  (consult-customize
   consult-ripgrep consult-git-grep consult-grep
   :initial (daut/selected-region-or-symbol-at-point)))

(use-package consult-flycheck
  :bind
  ("M-g f" . consult-flycheck))

(use-package marginalia
  :init (marginalia-mode))

(use-package embark
  :bind (("C-."   . embark-act)
         ("C-;"   . embark-dwim)
         ("C-h B" . embark-bindings)))

;; If you use the grepping commands from the Consult package, consult-grep, consult-git-grep or consult-ripgrep, then you should install the embark-consult package, which adds support for exporting a list of grep results to an honest grep-mode buffer, on which you can even use wgrep if you wish.
(use-package embark-consult)

(use-package wgrep)

;; Persist history over Emacs restarts. Vertico sorts by history position.
(use-package savehist
  :init
  (savehist-mode))

;; improved completion style
(use-package orderless
  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides nil)
  :config
  (setq orderless-matching-styles '(orderless-literal orderless-regexp)))
#+end_src

#+RESULTS:

* UI Configuration
** Basic
#+begin_src emacs-lisp
;; Show line numbers
(use-package display-line-numbers
  :ensure nil
  :hook ((prog-mode yaml-mode conf-mode astro-ts-mode) . display-line-numbers-mode)
  :init (setq display-line-numbers-width-start t))

;; Display ugly ^L page breaks as tidy horizontal lines
(use-package page-break-lines
  :diminish
  :hook (after-init . global-page-break-lines-mode))

(use-package beacon
  :init
  (beacon-mode)
  :config
  (setq beacon-color "#335533"))

#+end_src
