.emacs.d/init.el

(use-package dashboard
  :ensure t
  :custom
  (dashboard-startup-banner (concat user-emacs-directory "themes/emacs.txt"))
  :config
  (dashboard-setup-startup-hook)
  (add-to-list 'dashboard-footer-messages "Person who say it cannot be done should not interrupt person doing it.")
  (setq dashboard-center-content t
        dashboard-items '((projects . 4)
                          (recents . 4)
                          (bookmarks . 4)
                          (agenda . 4))
        dashboard-set-file-icons t
        dashboard-set-heading-icons t))

;; Make certain buffers different in color
;; e.g. popups, sidebars, terminals, etc.
(use-package solaire-mode
  :hook (after-init . solaire-global-mode))

;; defer loading of the package until command-log-mode is invoked
(use-package command-log-mode
  :commands command-log-mode)

(defun daut/print-current-theme ()
  "Print the currently active theme."
  (interactive)
  (if custom-enabled-themes
      (message "Current theme: %s" (car custom-enabled-themes))
    (message "No theme is currently active")))

(defun daut/random-color-theme ()
  "Load a random theme from the available themes."
  (interactive)
  (let ((themes (custom-available-themes)))
    (random t)
    (let ((selected-theme (nth (random (length themes)) themes)))
      (load-theme selected-theme t)
      (message "Selected theme: %s" selected-theme))))

(use-package ef-themes)
  ;; :config
  ;; (load-theme 'ef-autumn))
(add-to-list 'custom-theme-load-path (concat user-emacs-directory "themes/"))
;; (load-theme 'miasma t)
(use-package miasma-theme
  :vc (:fetcher github :repo daut/miasma-theme.el)
  :config (load-theme 'miasma t))

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))

(use-package nerd-icons)

;; Hide modelline in some major modes
(use-package hide-mode-line
  :hook (((eshell-mode shell-mode
           term-mode vterm-mode
           ;; embark-collect-mode
           lsp-ui-imenu-mode
           pdf-annot-list-mode) . hide-mode-line-mode)))

(use-package helpful
:bind
   ([remap describe-key]      . helpful-key)
   ([remap describe-command]  . helpful-command)
   ([remap describe-variable] . helpful-variable)
   ([remap describe-function] . helpful-callable))

(use-package highlight-indent-guides
  :hook ((prog-mode astro-ts-mode) . highlight-indent-guides-mode)
  :init (setq highlight-indent-guides-method 'character
              highlight-indent-guides-responsive 'top
              highlight-indent-guides-suppress-auto-error t))

;; When you visit a file, point goes to the last place
;; where it was when you previously visited the same file.
(use-package save-place
  :ensure nil
  :hook (after-init . save-place-mode))

;; Recentf is a minor mode that builds a list of recently opened files.
;; This list is automatically saved across sessions on exiting
;; Emacs - you can then access this list through a command or the menu.
(use-package recentf
  :bind (("C-x C-r" . recentf-open-files))
  :hook (after-init . recentf-mode)
  :init (setq recentf-max-saved-items 300
	            recentf-exclude
	            '("\\.?cache" ".cask" "url" "COMMIT_EDITMSG\\'" "bookmarks"
                "\\.\\(?:gz\\|gif\\|svg\\|png\\|jpe?g\\|bmp\\|xpm\\)$"
                "\\.?ido\\.last$" "\\.revive$" "/G?TAGS$" "/.elfeed/"
                "^/tmp/" "^/var/folders/.+$" "^/ssh:" "/persp-confs/"
                (lambda (file) (file-in-directory-p file package-user-dir))))
  :config
  (push (expand-file-name recentf-save-file) recentf-exclude)
  (add-to-list 'recentf-filename-handlers #'abbreviate-file-name))

;; Simple
(use-package simple
  :ensure nil
  :hook ((after-init . size-indication-mode)
	       (text-mode . visual-line-mode)
	       ((prog-mode markdown-mode conf-mode restclient-mode) . enable-delete-trailing-whitespace))
  :init
  (setq column-number-mode t
	      line-number-mode t)
  ;; Visualize TAB, (HARD) SPACE, NEWLINE
  (setq-default show-trailing-whitespace nil) ; Don't show trailing whitespace by default
  (defun enable-delete-trailing-whitespace ()
    "Show trailing spaces and delete on saving."
    (setq show-trailing-whitespace t)
    (add-hook 'before-save-hook #'delete-trailing-whitespace nil t)))

;; Enable short answers
(if (boundp 'use-short-answers)
    (setq use-short-answers t)
  (fset 'yes-or-no-p 'y-or-n-p))

(setq-default indent-tabs-mode nil) ; Permanently indent with spaces, never with TABs

(use-package flyspell
  :ensure nil
  :diminish
  :if (executable-find "aspell")
  :hook ((org-mode markdown-mode text-mode outline-mode) . flyspell-mode))

;; Handling capitalized subwords in a nomenclature
(use-package subword
  :ensure nil
  :diminish
  :hook ((prog-mode . subword-mode)
         (minibuffer-setup . subword-mode)))

(delete-selection-mode t)

(setq-default tab-width 2)

(setq-default indent-tabs-mode nil)

(use-package evil-nerd-commenter
  :bind ("s-/" . evilnc-comment-or-uncomment-lines))

(setq require-final-newline t)

(use-package paren
  :config
  (show-paren-mode +1))

(use-package elec-pair
  :config
  (electric-pair-mode +1)
  :init (setq electric-pair-inhibit-predicate 'electric-pair-default-inhibit))

(use-package multiple-cursors
  :bind ("s-d" . mc/mark-next-like-this-symbol))

(use-package move-text
  :bind
  ("C-s-j" . 'move-text-down)
  ("C-s-k" . 'move-text-up))

(defun daut/html-forward (arg)
  (interactive "P")
  (pcase (get-text-property (point) `mhtml-submode)
    (`nil (sgml-skip-tag-forward 1))
    (submode (forward-sexp))))

(use-package hideshow
  :diminish hs-minor-mode
  :hook
  (prog-mode . hs-minor-mode)
  (restclient-mode . hs-minor-mode)
  (nxml-mode . hs-minor-mode)
  (web-mode . hs-minor-mode)
  (html-mode . hs-minor-mode)
  :bind
  ("C-s-[" . hs-hide-block)
  ("C-s-]" . hs-show-block))

(use-package minimap
  :defer t
  :config
  (setq minimap-window-location 'right
        minimap-update-delay 0
        minimap-width-fraction 0.09
        minimap-minimum-width 15))

(use-package aggressive-indent
  :diminish
  :hook (emacs-lisp-mode . aggressive-indent-mode))

(use-package expand-region
  :bind ("C-=" . er/expand-region))

(defvar daut/killed-file-list nil
  "List of recently killed files")

(defun daut/add-file-to-killed-file-list ()
  (when buffer-file-name
    (push buffer-file-name daut/killed-file-list)))

(add-hook 'kill-buffer-hook #'daut/add-file-to-killed-file-list)

(defun daut/reopen-killed-file ()
  (interactive)
  (when daut/killed-file-list
    (find-file (pop daut/killed-file-list))))

(global-set-key (kbd "s-T") 'daut/reopen-killed-file)

;; (use-package editorconfig
;;   :hook (after-init . editorconfig-mode))

(use-package olivetti)
