Emacs.org
*** Language Servers
#+begin_src emacs-lisp

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :config
  (lsp-enable-which-key-integration t)
  (setq lsp-completion-provider :none)
  (setq lsp-headerline-breadcrumb-enable nil)
  (add-to-list 'lsp-disabled-clients '(typescript-mode . vue-semantic-server))
  (add-to-list 'lsp-disabled-clients '(typescript-ts-mode . vue-semantic-server))
  (add-to-list 'lsp-disabled-clients '(js-mode . vue-semantic-server))
  (add-to-list 'lsp-disabled-clients '(astro-ts-mode . vue-semantic-server))
  (add-to-list 'lsp-disabled-clients '(css-mode . vue-semantic-server))
  ;; https://github.com/emacs-lsp/lsp-mode/issues/2915#issuecomment-855156802
  (add-to-list 'lsp-language-id-configuration '(".*\\.liquid" . "html"))
  (setf (alist-get 'web-mode lsp--formatting-indent-alist) 'web-mode-code-indent-offset))
  ;; turn off lsp diagnostics to let flycheck do the job
  ;; (setq lsp-diagnostics-provider :none))

;; enhanced ui e.g. documentation popup
(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :config
  (setq lsp-ui-doc-position 'top)
  (setq lsp-ui-doc-delay 0.5)
  (setq lsp-ui-doc-max-width 80)
  (general-define-key
   :keymaps 'lsp-mode-map
   :prefix lsp-keymap-prefix
   "u" '(:ignore t :wk "lsp ui")
   "ui" '(lsp-ui-imenu t :which-key "imenu")))

#+end_src
*** Debugging With dape
#+begin_src emacs-lisp

(use-package dape
  :defer t
  :config
  (setq dape-buffer-window-arrangement 'right)
  (setq dape-inlay-hints t)
  (setq dape-cwd-fn 'projectile-project-root))
#+end_src
*** Astro
#+begin_src emacs-lisp
;; (use-package astro-ts-mode
;;   :mode "\\.astro\\'"
;;   :hook (astro-ts-mode . lsp-deferred))
#+end_src
*** Bash
#+begin_src emacs-lisp
(use-package bash-ts-mode
  :ensure nil
  :mode "\\.sh\\'"
  :mode "\\.bash\\'"
  :hook (bash-ts-mode . lsp-deferred)
  :config
  (setq sh-basic-offset 2))
(add-to-list 'interpreter-mode-alist '("bash" . bash-ts-mode))
#+end_src
*** TypeScript
#+begin_src emacs-lisp

(use-package typescript-mode
  :mode "\\.ts[x]\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))

#+end_src
*** JavaScript
#+begin_src emacs-lisp
(use-package js-mode
  :ensure nil
  :mode "\\.[c|m]js[x]\\'"
  :hook
  (js-mode . lsp-deferred)
  (js-mode . dtrt-indent-mode)
  :config
  (setq js-indent-level 2))

;; Adds node_modules/.bin directory to `exec_path'
;; This allows Emacs to find project based installs of e.g. eslint.
(use-package add-node-modules-path
  :hook ((web-mode js-mode js2-mode) . add-node-modules-path))
#+end_src
*** Lua
#+begin_src emacs-lisp

(use-package lua-mode
  :mode "\\.lua\\'"
  :hook (lua-mode . lsp-deferred)
  :config
  (setq lua-indent-level 2))

#+end_src
*** Go
#+begin_src emacs-lisp
(defun daut/go-fold-imports ()
  "Fold import statements in go file"
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (while (re-search-forward "^import" nil t)
      (let ((start (point)))
        (forward-line)
        (while (looking-at "^[ \t]+\"")
          (forward-line))
        (let ((end (point)))
          (hs-hide-block))
        (goto-char start)))))

(use-package go-mode
  :mode "\\.go\\'"
  :hook
  (go-mode . lsp-deferred)
  (before-save . gofmt-before-save)
  (go-mode . (lambda () (setq tab-width 2)))
  (go-mode . daut/go-fold-imports))

(use-package go-playground
  :after go-mode)

(use-package gotest
  :after go-mode)

(use-package flycheck-golangci-lint
  :hook (go-mode . flycheck-golangci-lint-setup))

#+end_src
*** JSON
#+begin_src emacs-lisp

(use-package js-json-mode
  :ensure nil
  :mode "\\.json\\'"
  :hook
  (js-json-mode . lsp-deferred)
  :config
  (setq js-indent-level 2))

#+end_src
*** Restclient
#+begin_src emacs-lisp
(use-package jq-mode)

;;; load restclient-jq - allow restclient mode to use jq to process JSON results.
;; (fetch it from remote url if it's already there)
(let
    ((restclient-jq-filename "~/.emacs.d/restclient-jq.el")
     (restclient-jq-url
      "https://raw.githubusercontent.com/pashky/restclient.el/master/restclient-jq.el"))
  (progn
    (unless (file-exists-p restclient-jq-filename)
      (url-copy-file restclient-jq-url restclient-jq-filename))
    (load "~/.emacs.d/restclient-jq.el")
    ))

(use-package restclient
  :mode ("\\.http\\'" . restclient-mode)
  :config
  (require 'restclient-jq)
  (with-eval-after-load 'company
    (use-package company-restclient
      :defines company-backends
      :init (add-to-list 'company-backends 'company-restclient))))

#+end_src
#+end_src
*** Yaml
#+begin_src emacs-lisp

(use-package yaml-mode
  :mode "\\.y[a]ml\\'"
  :mode "\\.y[a]ml\\.j2\\'")

#+end_src
*** Web
#+begin_src emacs-lisp
(defvar web-mode-electric-pairs '((?' . ?')) "Electric pairs for org-mode.")

(defun web-mode-add-electric-pairs ()
  (setq-local electric-pair-pairs (append electric-pair-pairs web-mode-electric-pairs))
  (setq-local electric-pair-text-pairs electric-pair-pairs))
;; Major mode for editing web templates
(use-package web-mode
  :hook
  (web-mode . lsp-deferred)
  (web-mode . web-mode-add-electric-pairs)
  (web-mode . dtrt-indent-mode)
  (web-mode . (lambda ()
                (setq yas-after-exit-snippet-hook nil)))
  :mode "\\.[px]?html?\\'"
  :mode "\\.\\(?:tpl\\|blade\\)\\(?:\\.php\\)?\\'"
  :mode "\\.erb\\'"
  :mode "\\.[lh]?eex\\'"
  :mode "\\.jsp\\'"
  :mode "\\.as[cp]x\\'"
  :mode "\\.ejs\\'"
  :mode "\\.hbs\\'"
  :mode "\\.mustache\\'"
  :mode "\\.svelte\\'"
  :mode "\\.twig\\'"
  :mode "\\.jinja2?\\'"
  :mode "\\.eco\\'"
  :mode "wp-content/themes/.+/.+\\.php\\'"
  :mode "templates/.+\\.php\\'"
  :mode "\\.vue\\'"
  :mode "\\.tmpl\\'"
  :mode "\\.gotmpl\\'"
  :mode "\\.gohtml\\'"
  :mode "\\.astro\\'"
  :mode "\\.liquid\\'"
  :config
  (setq web-mode-enable-auto-indent nil)
  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-css-indent-offset 2)
  (setq web-mode-code-indent-offset 2)
  (setq web-mode-script-padding 0)
  (setq web-mode-style-padding 0)
  (setq web-mode-engines-alist
        '(("go" . "\\.tmpl\\'")
          ("liquid" . "\\.liquid\\'"))))

;; CSS mode
(use-package css-mode
  :ensure nil
  :hook (css-mode . lsp-deferred)
  :init (setq css-indent-offset 2))
#+end_src
*** Vue
#+begin_src emacs-lisp
;; https://github.com/emacs-lsp/lsp-mode/issues/4313#issuecomment-2051461893
(with-eval-after-load 'lsp-volar
  (lsp-dependency 'typescript
                  '(:npm :package "typescript"
                         :path "tsserver")))
#+end_src
*** Elixir
#+begin_src emacs-lisp
(use-package elixir-mode
  :mode "\\.exs\\'"
  :hook (elixir-mode . lsp-deferred))
#+end_src
*** SQL
#+begin_src emacs-lisp
;; Needs sqls installed and sqlint would be nice also
;; sqls: go get github.com/lighttiger2505/sqls
;; sqlint: gem install sqlint
(use-package sql
  :hook
  ((sql-mode . lsp)
   (sql-interactive-mode . (lambda () (toggle-truncate-lines t))))
  :config
  (setq lsp-sqls-timeout 10)
  (setq lsp-sqls-workspace-config-path "root"))
#+end_src
*** Markdown
#+begin_src emacs-lisp
(use-package markdown-mode
  :hook ((markdown-mode elfeed-show-mode) . olivetti-mode))
#+end_src
*** Mermaid
Install `mmdc`
`npm install -g @mermaid-js/mermaid-cli`
https://github.com/mermaid-js/mermaid-cli
#+begin_src emacs-lisp
(use-package mermaid-mode
  :mode "\\.mermaid\\'")
#+end_src
*** PHP
#+begin_src emacs-lisp
(use-package php-mode
  :hook (php-mode . lsp-deferred))
#+end_src
*** DotEnv
#+begin_src emacs-lisp
(use-package dotenv-mode
  :mode "\\.env\\..*\\'")
#+end_src
*** Docker
#+begin_src emacs-lisp
(use-package dockerfile-mode)
#+end_src
*** Scheme
#+begin_src emacs-lisp
(use-package geiser-guile)
#+end_src
** Flycheck
#+begin_src emacs-lisp

(use-package flycheck
  :diminish
  :commands flycheck-redefine-standard-error-levels
  :hook (after-init . global-flycheck-mode)
  :config
  (flycheck-add-mode 'javascript-eslint 'web-mode)
  (setq flycheck-javascript-eslint-executable "eslint_d"))

#+end_src

** Code Formatting
#+begin_src emacs-lisp
(use-package apheleia
  :vc (:fetcher github :repo radian-software/apheleia)
  :hook (after-init . apheleia-global-mode)
  :config
  (cl-pushnew '(eslint . ("eslint_d" "--fix-to-stdout" "--stdin" "--stdin-filename" file))
              apheleia-formatters
              :test #'equal)
  (cl-pushnew '(prettier-liquid . ("apheleia-npx" "prettier" "--stdin-filepath" filepath "--parser=html"))
              apheleia-formatters
              :test #'equal))
#+end_src
