Emacs.org
** Avy
#+begin_src emacs-lisp
(use-package avy
  :bind (("s-." . avy-goto-char-timer)
         ("s-," . avy-goto-char)
         ("C-c ." . avy-goto-char-timer)
         ("C-c ," . avy-goto-char)
         ("M-g f" . avy-goto-line))
  :config
  (setq avy-background t)
  (setq avy-timeout-seconds 0.4))
#+end_src
** Simple HTTPD
#+begin_src emacs-lisp
(use-package simple-httpd)
#+end_src
** Ripgrep
#+begin_src emacs-lisp
(use-package rg)
#+end_src
** Tree-Sitter
#+begin_src emacs-lisp
(use-package treesit
  :ensure nil
  :config
  (setq treesit-language-source-alist
        '((astro "https://github.com/virchau13/tree-sitter-astro")
          (bash "https://github.com/tree-sitter/tree-sitter-bash")
          (css "https://github.com/tree-sitter/tree-sitter-css")
          (elisp "https://github.com/Wilfred/tree-sitter-elisp")
          (go "https://github.com/tree-sitter/tree-sitter-go")
          (gomod "https://github.com/camdencheek/tree-sitter-go-mod")
          (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
          (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
          (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
          (vue "https://github.com/ikatyang/tree-sitter-vue")))
  (setq treesit-font-lock-level 4))
#+end_src
** Docs
#+begin_src emacs-lisp
(use-package devdocs
  :defer t)
#+end_src
* AI Assistants
** gptel
#+begin_src emacs-lisp
(use-package gptel
  :config
  (setq gptel-backend (gptel-make-anthropic "Claude" :stream t :key gptel-api-key))
  (setq gptel-model 'claude-3-5-sonnet-20241022)
  (add-to-list 'gptel-directives '(proofreader . "I want you act as a proofreader. I will provide you texts and I would like you to review them for any spelling, grammar, or punctuation errors. Once you have finished reviewing the text, provide me with any necessary corrections or suggestions to improve the text.")))
#+end_src
** elysium
#+begin_src emacs-lisp
(use-package elysium
  :custom
  (elysium-window-size 0.33)
  (elysium-window-style 'vertical))
#+end_src
** copilot.el
#+begin_src emacs-lisp
(use-package copilot
  :hook ((prog-mode restclient-mode eshell-mode yaml-mode) . copilot-mode)
  :bind
  ("C-<tab>" . copilot-complete)
  :config
  (define-key copilot-completion-map (kbd "C-TAB") 'copilot-accept-completion)
  (define-key copilot-completion-map (kbd "C-<tab>") 'copilot-accept-completion)
  (setq copilot-indent-offset-warning-disable t)
  (setq copilot-max-char 1000000)
  (setq copilot-idle-delay nil)
  (defun daut/activate-copilot ()
    (if (> (buffer-size) copilot-max-char)
        ;; Or don't even warn to get rid of it.
        (warn "Buffer size exceeds copilot max char limit. Copilot will not be activated.")
      (copilot-mode))))
#+end_src
* VCS
** Magit
#+begin_src emacs-lisp

(use-package magit
  :commands magit-status
  :config
  (setq magit-diff-refine-hunk 'all))

(use-package magit-todos
  :after magit
  :config (magit-todos-mode 1))

;; add options to magit like create PR, track issues etc.
(use-package forge
  :after magit)

#+end_src
** Git Gutter
#+begin_src emacs-lisp
(use-package git-gutter
  :config (global-git-gutter-mode t))
;; try hl-mode (dired-mode . diff-hl-dired-mode)
#+end_src
** Blamer
#+begin_src emacs-lisp
(use-package blamer
  :ensure t
  :bind (("s-i" . blamer-show-commit-info)
         ("C-c i" . blamer-show-posframe-commit-info))
  :defer 20
  :custom
  (blamer-idle-time 0.3)
  (blamer-min-offset 70)
  :custom-face
  (blamer-face ((t :foreground "#7a88cf"
                    :background nil
                    :height 140
                    :italic t))))
#+end_src
* Terminals
** term-mode
#+begin_src emacs-lisp

(use-package term
  :commands term
  :config
  (setq term-prompt-regexp "^[^#$%>\\n]*[#$%>] *"))

(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))

#+end_src
** vterm
#+begin_src emacs-lisp

(use-package vterm
  :commands vterm
  :config
  (setq vterm-shell "zsh")
  (setq vterm-max-scrollback 10000))

#+end_src
** eshell
#+begin_src emacs-lisp

(use-package eshell-git-prompt
  :after eshell)

(defun daut/configure-eshell ()
  ;; save command history when commands are entered
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  ;; truncate buffer for performance
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  ;; better color support
  (add-hook 'eshell-mode-hook (lambda() (setenv "TERM" "xterm-256color")))

  (setq eshell-history-size         10000
        eshell-buffer-maximum-lines 10000
        eshell-history-ignoredups t
        eshell-scroll-to-bottom-on-input t))

(use-package eshell
  :hook (eshell-first-time-mode . daut/configure-eshell)
  :config
  (with-eval-after-load 'esh-opt
    (setq eshell-destroy-buffer-when-process-dies t)
    (setq eshell-visual-commands '("zsh" "vim")))
  (eshell-git-prompt-use-theme 'powerline))

(use-package esh-autosuggest
  :hook (eshell-mode . esh-autosuggest-mode))
#+end_src
* File Management
** Basic
#+begin_src emacs-lisp

;; Auto refresh buffers
(global-auto-revert-mode t)

;; Also auto refresh dired, but be quiet about it
(setq global-auto-revert-non-file-buffers t)
(setq auto-revert-verbose nil)

;; Make buffer list usable after previous changes
;; https://github.com/syl20bnr/spacemacs/issues/7661
;; https://github.com/syl20bnr/spacemacs/issues/2667#issuecomment-136155556
(add-hook 'Buffer-menu-mode-hook 
          (lambda ()
            (setq-local revert-buffer-function
                        (lambda (&rest args)))))

;; Backup files directory path
(setq backup-directory-alist `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms `((".*" ,temporary-file-directory t)))
(setq backup-by-copying-when-linked t)
(setq delete-old-versions t
      kept-new-versions 6
      kept-old-versions 2
      version-control t)

#+end_src

** Dired
Note: coreutils had to be installed on MacOS systems for group-directories-first to work so run `brew install coreutils`.
#+begin_src emacs-lisp

(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :config
  (when (string= system-type "darwin")
    (setq insert-directory-program (executable-find "gls")))
  (setq dired-kill-when-opening-new-dired-buffer t)
  :custom
  (dired-listing-switches "-agho --group-directories-first")
  (setq delete-by-moving-to-trash t))

;; Colorful dired
(use-package diredfl
  :hook (dired-mode . diredfl-mode))

;; Shows icons
(use-package nerd-icons-dired
  :diminish
  ;; :when (icons-displayable-p)
  ;; :custom-face
  ;; (nerd-icons-dired-dir-face ((t (:inherit nerd-icons-dsilver :foreground unspecified))))
  :hook (dired-mode . nerd-icons-dired-mode))

#+end_src
** Dired sidebar
#+begin_src emacs-lisp
(use-package dired-sidebar
  :bind (("s-b" . dired-sidebar-toggle-sidebar))
  :commands (dired-sidebar-toggle-sidebar)
  :custom
  (dired-sidebar-display-alist '((side . right)))
  :config
  (setq dired-sidebar-theme 'nerd))
#+end_src
** 0x0
#+begin_src emacs-lisp
(defun 0x0-upload-file (file-path)
  "Upload a file at FILE-PATH to 0x0.st and copy the URL to the kill ring."
  (interactive "fSelect a file to upload: ")
  (message "Sending %s to 0x0.st..." file-path)
  (let ((url (string-trim-right
              (shell-command-to-string
               (format "curl -s -F'file=@%s' https://0x0.st" (expand-file-name file-path))))))
    (message "0x0.st URL: %s" url)
    (kill-new url)))
#+end_src
* Window Management
** Basic
#+begin_src emacs-lisp
(setq switch-to-buffer-obey-display-actions t)

(defun daut/toggle-window-dedication ()
  "Toggles window dedication in the selected window."
  (interactive)
  (set-window-dedicated-p (selected-window)
                          (not (window-dedicated-p (selected-window)))))

(defun daut/toggle-window-size-fixed ()
  (interactive)
  (setq-default window-size-fixed (not window-size-fixed))
  (message "Window size fixed: %s" window-size-fixed))

(defvar-local daut/original-lock nil
  "Holds the original value of window-size-fixed.")

(defun daut/interactive-window-resize ()
  (interactive)
  (setq daut/original-lock window-size-fixed)
  (setq-default window-size-fixed nil)
  (hydra-window-scale/body))
#+end_src
